def area(a, b):
    '''
        Возвращает площадь прямоугольника по заданным сторонам

        Параметры: a, b (int): размер сторон прямоугольника
        Возвращаемое значение: a * b (int): площадь прямоугольника
    '''
    return a * b


def perimeter(a, b):
    '''
        Возвращает периметр прямоугольника по заданным сторонам

        Параметры: a, b (int): размер сторон прямоугольника
        Возвращаемое значение: (a + b) * 2 (int): периметр прямоугольника
    '''
    return (a + b) * 2
