def area(a, h):
    '''
        Возвращает площадь треугольника по заданной стороне и высоте

        Параметры: a, h (int): размер стороны и высоты треугольника
        Возвращаемое значение: a * h / 2 (int): площадь треугольника
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
        Возвращает периметр треугольника по заданным сторонам

        Параметры: a, b, c (int): размер сторон треугольника
        Возвращаемое значение: a + b + c (int): периметр треугольника
    '''
    return a + b + c
